tap "d12frosted/emacs-plus"
tap "homebrew/bundle"

brew "mas"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-nobu417-big-sur-icon"]

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "alfred"
cask "appcleaner"
cask "brave-browser"
cask "datagrip"
cask "docker"
cask "dropbox"
cask "fantastical"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "pycharm"
cask "rectangle"
cask "slack"
cask "spotify"
cask "vimr"
cask "zoom"

mas "1Password for Safari", id: 1569813296
mas "Day One", id: 1055511498
mas "Drafts", id: 1435957248
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Tailscale", id: 1475387142
mas "Things", id: 904280696
